{
  "title": "Cazeus Casino",
  "title-list": [
    "crypto friendly",
    "100% welcome bonus",
    "tournaments and challenges"
  ],
  "title-text": "Cazeus deserves its popularity, being one of the most trusted online casinos in the UK. It comes up with a wide selection of casino entertainment, safe payment methods, and a sports betting section with VIP programs and challenges. So there is always something for you to do here. The official website of Cazeus Casino is designed in the style of ancient Greek gods. Therefore, on the main pages you will find bright and colorful images of mythological characters.",
  "first-section-title": "Registration Process: Cazeus Login",
  "first-section-text-top": "It would be right to start the Cazeus review with the fact that potential clients of this platform will learn how to register and create an account. This procedure is not complicated and takes only a few minutes.",
  "first-section-list": [
    "Visit the official website and click on the registration button on the main page;",
    "Then in the new window, at the first stage, select one of the welcome bonus options;",
    "If desired, you can refuse the bonus or activate the promo code for Cazeus Casino no deposit bonus;",
    "Go to the next registration page;",
    "The next step is to fill your email address and create a strong password;",
    "Confirm that you are 18 years of age and agree with the terms and conditions of the online casino;",
    "On the following page, fill in the fields with the requested information."
  ],
  "first-section-text-bottom": "This is where registration is almost complete. Do not forget to open your mail and follow the link from the letter that will be automatically generated and sent to the address specified during registration.",
  "second-section-title": "Login: Cazeus Trustpilot",
  "second-section-text": "Thanks to Cazeus Casino login, you can get much more opportunities than playing in demo mode. Therefore, after registration, log in. To do this, on the main page, click on Login, enter your email and password. This will allow you to enter your account and proceed to the next stages of getting to know the popular online casino.",
  "third-section-title": "Verification: Cazeus Promo Code",
  "third-section-text": "If you want to collect your winnings after successful sports bets or slot spins, then fulfill the KYC requirements. To do this, go through verification. Put all your details and payment specifications in the given personal profile and as well attach the copies of the necessary particulars. The security service will verify the authenticity of that information, after which a notification will be sent to you confirming your successful verification.",
  "list": [
    {
      "title": "Deposit Methods: Cazeus Casino Promo Code",
      "contentList": {
        "topText": "Immediately after completing registration and authorization, you will need to make your first deposit to your game balance. You can use many payment systems for this:",
        "list": [
          "Visa;",
          "Mastercard;",
          "Skrill;",
          "MiFinity;",
          "Neteller;",
          "Paysafecard;",
          "Crypto."
        ],
        "lastText": "The minimum deposit, depending on the selected system, is from 10 GBP and more."
      }
    },
    {
      "title": "Withdrawal Methods: Casino Cazeus",
      "contentList": {
        "topText": "To collect your winnings, first go through verification and wager the bonus. Then you can use different methods:",
        "list": ["Bank transfer;", "Skrill;", "MiFinity;", "Crypto."],
        "lastText": "As for the Cazeus withdrawal time, the figure varies depending on the amount and system. For crypto transfers, it takes no more than 2-3 hours. Bank transfers can take up to 5 business days."
      }
    }
  ]
}
