{
  "title": "Bonuses and Promotions: Cazeus Free Spins",
  "content": "A logical continuation of Cazeus reviews will be current bonus offers available for new and regular players. Even at the registration stage, the user gets the opportunity to choose a welcome reward. The choice depends on whether you plan to play in a casino or bet on sports. An alternative option is to activate a bonus code.",
  "list": [
    {
      "title": "Welcome Casino Bonus",
      "content": "If you prefer to spin slots, bet on table games, and with live dealers, then choose a casino bonus for new customers. In this particular case, you stand to get a 100% bonus on the first deposit, which can go up to as high as 500 GBP, alongside another free 200 spins. The deposit size must be at least 10 GBP."
    },
    {
      "title": "Welcome Sports Bonus",
      "content": "If you wish to wager on various sports events, then select the best welcome bonus option. According to the terms of promotion, you shall receive a 100% bonus up to about 100 GBP once you've deposited 100 GBP."
    },
    {
      "title": "Weekday Reload Bonus",
      "content": "From Monday to Thursday, there is a special promotion. You must make a deposit of £20 or more in order to automatically gain a generous reload bonus of 50 free spins."
    },
    {
      "title": "Weekend Reload Bonus",
      "content": "If you play more often on weekends, then Cazeus Online Casino offers generous reload bonuses on Friday, Saturday and Sunday. As per the terms of the promotion, a deposit of £50 may earn the casino player a bonus of 50% topping at £700, as well as an additional 50 free spins package."
    },
    {
      "title": "Cashback Bonuses",
      "content": "Depending on whether you enjoy slots and table games or live dealer games, you have the chance to activate the offer in the format of a weekly cashback. For the live casino rewards, the cashback is 25% up to £200, while traditional casino games fetch a 15% cashback that goes up to £3000 every week."
    },
    {
      "title": "VIP Program",
      "content": "Regular and active players on the official service and on Cazeus sister sites can become members of the VIP program. To do this, you need to play, place bets, earn points and increase your level. There are 5 levels available in total, which open access to increased cashback, priority withdrawals, a personal manager and other offers."
    }
  ]
}
